backend/controllers/MerchantController.php

    protected function findModel($id)
    {
        if (($model = Merchant::findOne($id)) !== null) {
---
SELECT * FROM `mt_merchant` WHERE `merchant_id`='2'