backend/views/merchant/_form2.php

SELECT * FROM `mt_packages`
---
?>

<?php
echo $form->field($model,'package_id')
        ->dropDownList(ArrayHelper::map(\common\models\Packages::find()->all(), 'package_id', 'title'),
                [
                    'prompt' => 'select package'
                ]);