backend/views/merchant/_form3.php

SELECT * FROM `seo_rule` WHERE type=1
---
<?= $form->field($model, 'is_manual_seorule')->radioList(['0' => 'Seo Rule', '1'=>'Manual rule'],
    ['id'=>'ismanual'])->label(false) ;?>
<div id="seorule">
<?php echo $form->field($model, 'seo_rule_id')
        ->dropDownList(\yii\helpers\ArrayHelper::map(common\models\SeoRule::find()->where('type=1')->all(), 'id', 'name'),
                ['prompt' => 'Select Seo Rule'])?>