backend/views/layouts/admin_tpl.php

                                echo $current_language;
                                //exit;

                            $languages = \common\models\Language::find()->all();
---
SELECT * FROM `language`