common/models/Merchant.php

SELECT * FROM `schedule_days_template` WHERE `merchant_id`=2
---
			['attr'=>'schedule_days_template_id',
                        'label'=>'Schedule Days Template',
                        'type'=>'dropDown',
                        'data'=>\yii\helpers\ArrayHelper::map(ScheduleDaysTemplate::find()
				->where(['merchant_id'=>Yii::$app->user->id])->all(),'id','title')