common/models/Option.php

    public static function getValByName($name)
    {
        $model = self::findOne(['option_name' => $name]);
---
SELECT * FROM `mt_option` WHERE `option_name`='website_title'