backend/models/AdminUser.php

    public static function findIdentity($id)
    {
        return static::findOne(['admin_id' => $id]);
---
SELECT * FROM `mt_admin_user` WHERE `admin_id`=2

    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username]);
---
SELECT * FROM `mt_admin_user` WHERE `username`='AG-admin'