backend/views/dashboard/index.php

SELECT * FROM `category_has_merchant` WHERE `id`='79'
---
                        foreach(\backend\components\DashboardHelper::getPopularCats() as $val){?>
                            <div class="progress-group">
                                <span class="progress-text"><?php
                                $title = \frontend\models\CategoryHasMerchant::findOne(['id'=>$val['category_id']]);