backend/components/AdminHelper.php

SELECT * FROM `mt_option`
---
    public static function getOptionAdmin($option_name = '')
    {

        if (is_null(self::$_options)) {
            $models = \common\models\Option::find()->all();