backend/components/DashboardHelper.php

    public static function getPopularCats(){
//        $crit = new CDbCriteria();
//        $crit->select = 'COUNT(*) as count_by_date, category_id';
//
//        $crit->group = 'category_id';
//        $crit->order = 'count_by_date DESC';
//        $crit->addCondition('create_time>="' . date('Y-01-01 00:00:00') . '"');
//        $crit -> limit = 4;


        $models = \frontend\models\Order::find()
                ->select('COUNT(*) as count_by_date, category_id')
                ->where('create_time>="' . date('Y-01-01 00:00:00') . '"')
                ->groupBy('category_id')
                ->orderBy('count_by_date DESC')
                ->limit(4)
                ->asArray()
                ->all();
---
SELECT COUNT(*) as count_by_date, `category_id` FROM `order` WHERE create_time>="2017-01-01 00:00:00" GROUP BY `category_id` ORDER BY `count_by_date` DESC LIMIT 4

    public static  function CountByMonth()
    {
//        $crit = new CDbCriteria();
//        $crit->select = 'MONTH(create_time) as date_of_order, COUNT(id) as count_by_date, create_time';
//        $crit->group = 'MONTH(create_time)';
//        $crit->condition = 'create_time>="'.date('Y-01-01').'"';
//        $crit->order = 'create_time';

        $orders = $models = \frontend\models\Order::find()
                ->select('MONTH(create_time) as date_of_order, COUNT(id) as count_by_date, create_time')
                ->where('create_time>="'.date('Y-01-01').'"')
                ->groupBy('MONTH(create_time)')
                ->orderBy('create_time')
                ->asArray()
                ->all();
---
SELECT MONTH(create_time) as date_of_order, COUNT(id) as count_by_date, `create_time` FROM `order` WHERE create_time>="2017-01-01" GROUP BY MONTH(create_time) ORDER BY `create_time`